private/retrieveRolesForDataflowRequest.xml

<soap12:Envelope
    xmlns:cdx="http://www.exchangenetwork.net/wsdl/register/1"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <cdx:RetrieveRolesForDataflow>
      <securityToken><%= securityToken %></securityToken>
      <user>
        <userId><%= userId %></userId>
        <firstName><%= firstName %></firstName>
        <lastName><%= lastName %></lastName>
        <middleInitial><%= middleInitial %></middleInitial>
      </user>
      <dataflow><%= dataflowName %></dataflow>
    </cdx:RetrieveRolesForDataflow>
  </soap12:Body>
</soap12:Envelope>
